<?php

return [
    'r_success' => 'تم جلب البيانات بنجاح',
    'error' => [
        'create_user' => 'حدث خطأ أثناء إنشاء المستخدم',
        'generate_token' => 'حدث خطأ أثناء إنشاء رمز التحقق',
        'credentials' => 'خطأ في اسم المستخدم أو كلمة المرور',
        'token' => 'رمز التحقق غير صحيح',
        'logout' => 'حدث خطأ أثناء تسجيل الخروج',
        'verify' => 'حدث خطأ أثناء التحقق من رمز المرور',
        'verified' => 'هذا الحقل مؤكد مسبقاً',
        'password-change' => 'حدث خطأ أثناء تغيير كلمة المرور',
        'reset' => 'حدث خطأ أثناء إعادة تعيين كلمة المرور',
    ],
    'success' => [
        'create_user' => 'تم إنشاء المستخدم بنجاح',
        'generate_token' => 'تم إنشاء رمز التحقق بنجاح',
        'login' => 'تم تسجيل الدخول بنجاح',
        'logout' => 'تم تسجيل الخروج بنجاح',
        'otp' => 'تم إرسال رمز التحقق بنجاح',
        'verify' => 'تم التحقق من رمز المرور بنجاح',
        'password-change' => 'تم تغيير كلمة المرور بنجاح',
    ],
];
